package com.company;
/** создать классы с деньгами (с двумя конструкторами, в которые передаются деньги в валюте и условных единицах),
 * которые реализуют интерфейс мани с методом amount, который будет возвращать количестево денег в условных единицах
 * сделать класс сумма, который будет принимать интерфейс мани, и будет выдавать сумму денег в условных единицах
 * использовать это для того, чтобы переводить одни деньги в другие
 */
public class Main {

    public static void main(String[] args) {

    }
}
